# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [18]:
import pandas as pd

In [19]:
d=[4,8,15,16,23,42]

In [20]:
df=pd.DataFrame(d)

In [21]:
df

    0
0   4
1   8
2  15
3  16
4  23
5  42

 # Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [22]:
l=[]
for i in range(10):
    l.append(i)

In [23]:
l

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [24]:
pd.Series(l)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [25]:
data={"Name":['Alice','bob','claire'],"Age":[25,30,27],"Gender":['female','male','female']}

In [26]:
df1=pd.DataFrame(data)

In [27]:
df1

     Name  Age  Gender
0   Alice   25  female
1     bob   30    male
2  claire   27  female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# A dataframe is two -dimensional data structure that can store data of different types in columns it is similar to a spreadsheet a SQL table or R data frame

# A series is a one -dimensional data stucture that  can store data of any type  it is similar to a list an array or a column in a table

In [28]:
# it is the dataframe
data={"Name":['Alice','bob','claire'],"Age":[25,30,27],"Gender":['female','male','female']}

In [29]:
df2=pd.DataFrame(data)

In [30]:
df2

     Name  Age  Gender
0   Alice   25  female
1     bob   30    male
2  claire   27  female

In [31]:
# it is series
s=pd.Series(['ram ','rohan','sohan'])

In [32]:
s

0     ram
1    rohan
2    sohan
dtype: object

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [33]:
data={"Name":['Alice','bob','claire'],"Age":[25,30,27],"Gender":['female','male','female']}

In [35]:
df3=pd.DataFrame(data)

In [36]:
df3

     Name  Age  Gender
0   Alice   25  female
1     bob   30    male
2  claire   27  female

In [38]:
df3.sort_values

<bound method DataFrame.sort_values of      Name  Age  Gender
0   Alice   25  female
1     bob   30    male
2  claire   27  female>

In [40]:
df3.T

             0     1       2
Name     Alice   bob  claire
Age         25    30      27
Gender  female  male  female

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?



# According to the web search results, the answer is DataFrame and Panel. Both of these data structures are size-mutable and data-mutable, meaning that they can change their shape and value. A Series, on the other hand, is only value-mutable, not size-mutable. The length of a Series can not be changed although the values can be changed.